[{"Date":"November 9th 2012","Author":"Nathan Tuckey","Message":"<p>Hello eNewsers,</p><p>After hurricane Sandy and the chilly temperatures of the Nor'easter we have a beautiful weekend to look forward to with lots of sunshine and temperatures around sixty. Hopefully, most of you have restored power. Since I'm still sitting in the dark, I'm second guessing my own comments last Sunday about who gets power back first . . .lol. Seriously, hopefully we will all be up and running by Sunday evening.</p><p>Just today South Ridge consistently received phone & internet service, however we are told to still expect periodic interruptions. Hopefully, our phones will be working for the majority of the time from here on out.</p><p>Thank you to all those who offered to help in a myriad of ways last Sunday. More help was offered than what could be utilized in meeting the needs we were made aware of. Thank you so much.</p><p>An opportunity related to Sandy is that churches in the local area have banded together to provide necessary items to the Hoboken/New York City Area. The following items are needed: Non-perishable food (major need), diapers for kids & adults, socks & underwear, cleaning supplies (mops, brooms, cleaning solutions etc.), laundry detergent, blankets. You can purchase any of the above items and take them directly to the delivery truck located in the parking lot of Clinton Church of the Nazarene at 80 Beaver Avenue in Clinton Township by Monday evening, November 12th.</p><p>This Sunday I will be teaching from <a href=\"http://www.biblegateway.com/passage/?search=2%20Corinthians%2012:14-21&version=NIV;NLT;MSG\" target=\"_blank\">2 Corinthians 12:14-21</a> with a message focused on \"Investment & Conduct\" in our series Colors of the New Community. I'm excited about it. We will also have some child dedications. Additionally, keep in mind SRCC's own Thanksgiving opportunities that we introduced last Sunday. We'll remind you again this week.</p><p>Together For Him,</p><p>Nathan</p>"}]